app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "email", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 22 Apr 2014 23:51:18 UTC +00:00], ["email", "gizmo@gizmo.gizmo"], ["name", "Gizmo"], ["updated_at", Tue, 22 Apr 2014 23:51:18 UTC +00:00], ["user_id", 1]]
---
  def create
    contact = Contact.new(contact_params)

    if contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 5]]
---
  def destroy
    contact = Contact.find(params[:id])

    contact.destroy

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    contact = Contact.find(params[:id])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "contacts" SET "email" = ?, "updated_at" = ? WHERE "contacts"."id" = 5  [["email", "gizmo@aol.com"], ["updated_at", Tue, 22 Apr 2014 23:52:13 UTC +00:00]]
---
  def update
    contact = Contact.find(params[:id])

    if contact.update_attributes(contact_params)