app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Tue, 22 Apr 2014 23:43:09 UTC +00:00], ["updated_at", Tue, 22 Apr 2014 23:43:09 UTC +00:00], ["username", "Ryan"]]

  def update
    user = User.find(params[:id])

    if user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["username", "Jacob"], ["updated_at", Tue, 22 Apr 2014 23:43:44 UTC +00:00]]